# -*- coding: utf-8 -*-
"""
@File    : Russian2Chinese.py
@Time    : 2022/3/21 18:11
@Author  : Leonardo Zhou
@Email   : 2974519865@qq.com
@Software: PyCharm
"""

rus2chiDict = {
    'в':'在',
    'Дата': '日期',
    'выхода': '发售',
    'Разработчик': '开发商',
    'Жанр': '类型',
    # 游戏类型
    'Экшены': '动作',
    'Приключения': '冒险',
    'Шутеры': '射击',
    'Гонки': '竞速',
    'RPG': 'RPG',
    'Стратегии': '策略',
    'Выживание': '生存',
    'Симуляторы': '模拟',
    'Спортивные': '运动',
    'Инди': '独立的',
    'Аркады':'街机',
    'Игры по сети':'在线游戏',
    'Аниме':'日本动画',
    # 月份
    'янв.': '1月',
    'фев.': '2月',
    'мар.': '3月',
    'апр.': '4月',
    'май.': '5月',
    'июн.': '6月',
    'июл.': '7月',
    'авг.': '8月',
    'сен.': '9月',
    'окт.': '10月',
    'ноя.': '11月',
    'дек.': '12月',
    # 游戏大小
    'ГБ': 'GB',
    'МБ': 'MB',
    'GB':'GB',
    'MB':'MB',

    'Версия': '版本',
}
